-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Дек 07 2024 г., 15:18
-- Версия сервера: 10.4.28-MariaDB
-- Версия PHP: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `online_library`
--

-- --------------------------------------------------------

--
-- Структура таблицы `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `author` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `genre` varchar(255) NOT NULL,
  `file_path` varchar(255) DEFAULT NULL,
  `user_id` int(11) NOT NULL,
  `image_path` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `books`
--

INSERT INTO `books` (`id`, `title`, `author`, `description`, `created_at`, `genre`, `file_path`, `user_id`, `image_path`) VALUES
(1, 'Көшпенділер', 'Есенберлин', 'Қазақ хандығының құрылуы', '2024-11-18 10:50:48', '', NULL, 0, NULL),
(2, 'Абай Жолы', 'Мұхтар Ауезов', '«Абай жолы» - қазақ жазушысы Мұхтар Әуезовтың тарихи–өмірбаяндық романы. Абай жолы романы қазақ әдебиетіндегі тұңғыш жазылған роман-эпопея саналады. Роман әр жылдары бірнеше кітап ретінде жарыққа шықты. Атап айтқанда 1-кітап 1942 жылы, 2-кітап 1947 жылы, 3-кітап 1952 (кей деректерде 1954) жылы, ал 4-кітап 1956 жылы жарыққа шықты.', '2024-11-25 06:14:01', 'Роман', 'uploads/f717dd76ed6d547df8d73ff0759645c2.png', 0, NULL),
(3, 'Абай жолы', 'Мұхтар Ауезов', '«Абай жолы» - қазақ жазушысы Мұхтар Әуезовтың тарихи–өмірбаяндық романы. Абай жолы романы қазақ әдебиетіндегі тұңғыш жазылған роман-эпопея саналады. Роман әр жылдары бірнеше кітап ретінде жарыққа шықты. Атап айтқанда 1-кітап 1942 жылы, 2-кітап 1947 жылы, 3-кітап 1952 (кей деректерде 1954) жылы, ал 4-кітап 1956 жылы жарыққа шықты.', '2024-11-25 06:20:19', 'Роман', 'uploads/Абай жолы.1 кітап.pdf', 0, NULL),
(4, 'Гауһар тас', 'Дулат Исабеков', 'Дулат Исабековтың бұл повесі қазақтың халық әнімен аттас. Бірақ аты ғана ұқсамайды, бар болмысымен, сарынымен де салған әнге ұқсайды. Бір-біріне қарама-қайшы мінездердің бір шаңырақ астына жиналуынан пайда болған жағдаяттар баяндалып, сол аралықтағы көңілдер, сыртқа шыққан-шықпаған сезімдер бірте-бірте шашақталып, оқырман назарына ақырын-ақырын ілініп, тек соңында ғана толығымен айқара ашылады. Кітап жасөспірімдер мен ересектерге арналады', '2024-11-25 06:33:09', 'Роман', 'uploads/Гауһар тас. Дулат Исабеков.pdf', 0, NULL),
(5, 'Қан мен тер', 'Әбдіжәміл Нұрпейісов', '1916-1918 жылдардағы халық қозғалысын әлеуметтік-психологиялық тәсілмен суреттейтін, өрістетілген ішкі монологке құрылған бұл роман нағыз замана эпосы. Кезінде «Қан мен тер» романы жанрын эпопея жанрына қарсы қоюшылар табылды. «Ішкі драматизм сыртқы қабыршақты бұзып, мән-мағынаға бойлатады».', '2024-11-25 07:02:01', 'Роман', NULL, 6, NULL),
(6, 'Ұйықтама, оян, Алашым', 'Нұржан Наушабайұлы', 'Әдебиет тарихында лайықты бағасын алса да, шығармалары соңғы уақытқа дейін көпшілікке тұтас жетпей жатқан ақынның бірі – Нұржан Наушабайұлы. Тақтақ ақынның өлеңдері кезінде аз да болса жарық көріп, белгілі әдебиетшілер пікірлерін білдірді,  бірақ көп уақытқа дейін шығармашылығы толық зерттелмеді. Оқырманға ұсынылып отырған осы кітап ақынның кейіннен табылған өлең-жырларымен қатар толғау термелер, ғазалдар, назымдар, әндер, айтыстар және мысалдарымен толықтырылды. Сонымен қатар өлеңмен жазылған шежіресі де еніп отыр. Ақын шығармалары әлі толық жинастырылмаса да, бұл жинақтың кітапсүйер қауымға берері мол.\r\nЖинақ көпшілік оқырманға арналған.', '2024-11-25 08:15:25', 'Роман', NULL, 6, NULL),
(7, 'Бақытсыз Жамал.', 'Міржақып Дулатұлы', '«Бақытсыз Жамал» — Міржақып Дулатұлының 1910 жылы жарық көрген, қазақ әдебиетінде көркем прозалық үлгіде жазылған тұңғыш роман.', '2024-11-25 09:32:17', 'Классика', '674444211c631.pdf', 6, '674444211c614.jpeg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
